---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamCutbackForColumn
source: html/5c73d2f2-c7c4-fbcb-881d-2603a268dcf8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamCutbackForColumn Property

"Beam cutback in plan"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamCutbackForColumn { get; }
```